<?php

return [
    'name' => 'ตัวนำเข้า WordPress',
    'description' => 'เครื่องมือนี้ช่วยอำนวยความสะดวกในการนำเข้าข้อมูลบล็อก WordPress เช่น บทความ แท็ก ผู้ใช้ และหมวดหมู่เข้าสู่ระบบของคุณ หากคุณต้องการนำเข้าข้อมูล WooCommerce โปรดดูส่วนด้านล่างสำหรับคำแนะนำ',
    'copy_images' => 'คัดลอกรูปภาพ',
    'copy_images_description' => 'รูปภาพเด่นสำหรับบทความและหน้าจะถูกคัดลอกไปยังพื้นที่เก็บข้อมูลของคุณ หากคุณเลือก "ไม่" การอ้างอิงรูปภาพจะยังคงเหมือนเดิมและจะไม่มีการคัดลอกรูปภาพ',
    'copy_categories' => 'คัดลอกหมวดหมู่',
    'copy_categories_description' => 'หมวดหมู่สำหรับบทความจะถูกคัดลอก หากคุณยกเลิกการเลือก คุณสามารถเลือกหมวดหมู่เริ่มต้นสำหรับบทความที่นำเข้าทั้งหมด',
    'options' => 'ตัวเลือก',
    'select_default_category' => 'เลือกหมวดหมู่เริ่มต้น',
    'loading' => 'กำลังโหลด...',
    'upload_xml' => 'อัปโหลดไฟล์ส่งออก XML ของ WordPress ด้านล่างแล้วคลิกนำเข้า',
    'timeout_description' => 'เมื่อคัดลอกบทความและรูปภาพจากเว็บไซต์ของคุณอาจใช้เวลาสักครู่หากคุณมีข้อมูลจำนวนมาก ตั้งค่านี้ให้สูงที่สุดเท่าที่ต้องการเพื่อป้องกันการหมดเวลาของสคริปต์',
    'max_timeout' => 'เวลาหมดเวลาสูงสุด (วินาที)',
    'wp_xml_file' => 'ไฟล์ XML ของ WordPress',
    'wp_xml_file_description' => 'ในแผงควบคุม WordPress คุณสามารถเลือกส่งออกข้อมูลโดยไปที่เครื่องมือ->ส่งออก',
    'import' => 'นำเข้า',
    'xml_file_required' => 'โปรดระบุไฟล์ XML ของ WordPress ที่คุณต้องการอัปโหลด',
    'invalid_xml_file' => 'ประเภทไฟล์ไม่ถูกต้อง โปรดตรวจสอบว่าคุณกำลังอัปโหลดไฟล์ส่งออก XML ของ WordPress',
    'import_success' => 'นำเข้า :posts บทความ, :pages หน้า, :categories หมวดหมู่, :tags แท็ก และ :users ผู้ใช้สำเร็จ!',
    'load_seo_meta' => 'โหลดข้อมูล SEO Meta',
    'load_seo_meta_description' => 'โหลดข้อมูล SEO Meta (สำหรับบทความและหน้า) จากปลั๊กอิน WordPress Yoast SEO',
    'load_more' => 'โหลดเพิ่มเติม',
    'data_synchronize' => [
        'import_products' => [
            'name' => 'สินค้า WooCommerce',
            'description' => 'นำเข้าข้อมูลสินค้า WooCommerce จากไฟล์ CSV',
            'export_instruction' => 'เพื่อรับไฟล์ CSV สินค้า WooCommerce ไปที่แผงควบคุม WordPress จากนั้นไปที่สินค้า -> สินค้าทั้งหมด คลิกปุ่ม "ส่งออก" ที่มุมซ้ายบน เลือกข้อมูลสินค้าที่ต้องการส่งออกและเลือกรูปแบบไฟล์ที่เหมาะสม (CSV) สุดท้ายคลิกปุ่ม "สร้าง CSV" เพื่อดาวน์โหลดไฟล์ที่ส่งออก',
        ],
    ],
];
