<?php

return [
    'name' => 'مستورد ووردبريس',
    'description' => 'تسهّل هذه الأداة استيراد بيانات مدونة ووردبريس مثل المقالات والوسوم والمستخدمين والتصنيفات إلى نظامك. إذا كنت بحاجة إلى استيراد بيانات ووكومرس، يرجى الرجوع إلى القسم أدناه للحصول على التعليمات.',
    'copy_images' => 'نسخ الصور',
    'copy_images_description' => 'سيتم نسخ الصور المميزة للمقالات والصفحات إلى مساحة التخزين الخاصة بك. إذا اخترت "لا" ستبقى مراجع الصور كما هي ولن يتم نسخ أي صور.',
    'copy_categories' => 'نسخ التصنيفات',
    'copy_categories_description' => 'سيتم نسخ تصنيفات المقالات. إذا ألغيت التحديد يمكنك اختيار تصنيف افتراضي لجميع المقالات المستوردة.',
    'options' => 'الخيارات',
    'select_default_category' => 'اختر التصنيف الافتراضي',
    'loading' => 'جارٍ التحميل...',
    'upload_xml' => 'قم بتحميل ملف تصدير ووردبريس XML أدناه وانقر على استيراد.',
    'timeout_description' => 'عند نسخ المقالات والصور من موقعك قد يستغرق الأمر بعض الوقت إذا كان لديك الكثير من البيانات، اضبط هذا على أعلى قيمة تريدها لمنع انتهاء مهلة البرنامج النصي.',
    'max_timeout' => 'الحد الأقصى للمهلة بالثواني',
    'wp_xml_file' => 'ملف ووردبريس XML',
    'wp_xml_file_description' => 'داخل لوحة إدارة ووردبريس يمكنك اختيار تصدير البيانات بزيارة أدوات->تصدير.',
    'import' => 'استيراد',
    'xml_file_required' => 'يرجى تحديد ملف ووردبريس XML الذي ترغب في تحميله.',
    'invalid_xml_file' => 'نوع ملف غير صالح. يرجى التأكد من أنك تقوم بتحميل ملف تصدير ووردبريس XML.',
    'import_success' => 'تم استيراد :posts مقالة، :pages صفحة، :categories تصنيف، :tags وسم، و :users مستخدم بنجاح!',
    'load_seo_meta' => 'تحميل بيانات SEO الوصفية',
    'load_seo_meta_description' => 'تحميل بيانات SEO الوصفية (للمقالات والصفحات) من إضافة Yoast SEO في ووردبريس.',
    'load_more' => 'تحميل المزيد',
    'data_synchronize' => [
        'import_products' => [
            'name' => 'منتجات ووكومرس',
            'description' => 'استيراد بيانات منتجات ووكومرس من ملف CSV.',
            'export_instruction' => 'للحصول على ملف CSV لمنتجات ووكومرس، انتقل إلى لوحة تحكم ووردبريس، ثم انتقل إلى المنتجات -> جميع المنتجات. انقر على زر "تصدير" الموجود في الزاوية العلوية اليسرى. حدد بيانات المنتج التي ترغب في تصديرها واختر تنسيق الملف المناسب (CSV). أخيرًا، انقر على زر "إنشاء CSV" لتنزيل الملف المصدّر.',
        ],
    ],
];
