<?php

return [
    'name' => 'Імпортер WordPress',
    'description' => 'Цей інструмент полегшує імпорт даних блогу WordPress, таких як записи, мітки, користувачі та категорії у вашу систему. Якщо вам потрібно імпортувати дані WooCommerce, зверніться до розділу нижче.',
    'copy_images' => 'Копіювати зображення',
    'copy_images_description' => 'Обрані зображення записів і сторінок будуть скопійовані у ваше сховище. Якщо ви оберете "Ні", посилання на зображення залишаться незмінними і жодне зображення не буде скопійовано.',
    'copy_categories' => 'Копіювати категорії',
    'copy_categories_description' => 'Категорії записів будуть скопійовані. Якщо зняти позначку, можна вибрати категорію за замовчуванням для всіх імпортованих записів.',
    'options' => 'Параметри',
    'select_default_category' => 'Вибрати категорію за замовчуванням',
    'loading' => 'Завантаження...',
    'upload_xml' => 'Завантажте файл експорту WordPress XML нижче і натисніть Імпорт.',
    'timeout_description' => 'При копіюванні записів і зображень з вашого сайту це може зайняти деякий час, якщо у вас багато даних. Встановіть це значення якомога вище, щоб запобігти тайм-ауту скрипта.',
    'max_timeout' => 'Максимальний тайм-аут у секундах',
    'wp_xml_file' => 'XML-файл WordPress',
    'wp_xml_file_description' => 'У панелі адміністратора WordPress ви можете експортувати дані, перейшовши до Інструменти->Експорт.',
    'import' => 'Імпорт',
    'xml_file_required' => 'Будь ласка, вкажіть файл WordPress XML, який ви хочете завантажити.',
    'invalid_xml_file' => 'Недопустимий тип файлу. Переконайтеся, що ви завантажуєте файл експорту WordPress XML.',
    'import_success' => 'Успішно імпортовано :posts записів, :pages сторінок, :categories категорій, :tags міток та :users користувачів!',
    'load_seo_meta' => 'Завантажити SEO-метадані',
    'load_seo_meta_description' => 'Завантажити SEO-метадані (для записів і сторінок) з плагіна WordPress Yoast SEO.',
    'load_more' => 'Завантажити ще',
    'data_synchronize' => [
        'import_products' => [
            'name' => 'Товари WooCommerce',
            'description' => 'Імпорт даних товарів WooCommerce з файлу CSV.',
            'export_instruction' => 'Щоб отримати файл CSV товарів WooCommerce, перейдіть до панелі адміністратора WordPress, потім до Товари -> Усі товари. Натисніть кнопку "Експорт" у верхньому лівому куті. Виберіть дані товарів для експорту та виберіть формат файлу (CSV). Нарешті, натисніть "Згенерувати CSV" для завантаження експортованого файлу.',
        ],
    ],
];
